Repository: semenenkov/fig-leaf
Catalog: FigLeaf.Core/Properties/Resources.*.resx
Languages: ru_ru

# Common_Culture
source: en-US
ru_ru: ru-RU

# Common_Language
source: English
ru_ru: Русский

# Core_FileProcessor_CreatingThumbFormat
source: Create thumbnail file {0}
ru_ru: Создадим эскиз {0}

# Core_FileProcessor_DeletingObsoleteTargetFileFormat
source: Delete obsolete target file {0}
ru_ru: Удалим устаревший архивный файл {0}

# Core_FileProcessor_DeletingObsoleteThumbFormat
source: Delete obsolete thumbnail file {0}
ru_ru: Удалим устаревший эскиз {0}

# Core_FileProcessor_DeletingTargetDirWoSourceFormat
source: Delete target folder without source {0} (with {1} sub-folders and {2} files)
ru_ru: Удалим архивную папку отсутствующую в источнике {0} (с {1} подпапками and {2} файлами)

# Core_FileProcessor_DeletingTargetFileWoSourceFormat
source: Delete target file without source {0}
ru_ru: Удалим архивный файл отсутствующий в источнике {0}

# Core_FileProcessor_LogSum_CreatedTargetDirsFormat
source: Created target folders: {0}
ru_ru: Создано архивных папок: {0}

# Core_FileProcessor_LogSum_CreatedTargetFilesFormat
source: Created target files: {0}
ru_ru: Создано архивных фалов: {0}

# Core_FileProcessor_LogSum_CreatedTargetThumbsFormat
source: Created target thumbnails: {0}
ru_ru: Создано эскизов: {0}

# Core_FileProcessor_LogSum_ProcessedSourceDirsFormat
source: Processed source folders: {0}
ru_ru: Обработано исходных папок: {0}

# Core_FileProcessor_LogSum_ProcessedSourceFilesFormat
source: Processed source files: {0}
ru_ru: Обработано исходных файлов: {0}

# Core_FileProcessor_LogSum_RemovedObsoleteTargetFilesFormat
source: Removed obsolete target files: {0}
ru_ru: Удалено устаревших архивных файлов: {0}

# Core_FileProcessor_LogSum_RemovedObsoleteTargetThumbsFormat
source: Removed obsolete target thumbnails: {0}
ru_ru: Удалено устаревших эскизов: {0}

# Core_FileProcessor_LogSum_RemovedTargetDirsWoSourceFormat
source: Removed target folders without source: {0}
ru_ru: Удалено архивных каталогов отсутствующих в источнике: {0}

# Core_FileProcessor_LogSum_RemovedTargetFilesWoSourceFormat
source: Removed target files without source: {0}
ru_ru: Удалено архивных файлов отсутствующих в источнике: {0}

# Core_FileProcessor_NonEmptyTargetDirError
source: Target dir must be empty
ru_ru: Целевая папка должна быть пустой

# Core_FileProcessor_PackingFileFormat
source: Pack file {0} to {1}
ru_ru: Архивируем файл {0} в {1}

# Core_FileProcessor_SkipFigLeafDirFormat
source: Skip FigLeaf folder {0}
ru_ru: Пропускаем каталог программы {0}

# Core_FileProcessor_UnpackingFileFormat
source: Unpack file {0} to {1}
ru_ru: Распаковываем файл {0} в {1}

# Core_PasswordRule_FileNameNumbersPlusPassword
source: File name numbers followed by master password
ru_ru: Цифры из имени файла + базовый пароль

# Core_PasswordRule_Password
source: Master password only
ru_ru: Только базовый пароль

# Core_PasswordRule_PasswordPlusFileNameNumbers
source: Master password followed by file name numbers
ru_ru: Базовый пароль + цифры из имени файла

# Core_ThumbErrorFormat
source: Failed to make thumbnail for the file {0}: {1}
ru_ru: Не удалось создать эскиз для файла {0}: {1}

# Ui_Actions_Cancel
source: Cancel
ru_ru: Отмена

# Ui_Actions_DetailedLogging
source: (detailed logging)
ru_ru: (показывать детали)

# Ui_Actions_Header
source: Actions
ru_ru: Действия

# Ui_Actions_Log
source: Log
ru_ru: Протокол

# Ui_Actions_RestoreTargetTo
source: Unpack to ..
ru_ru: Восстановить ..

# Ui_Actions_UpdateTarget
source: Pack
ru_ru: Запустить

# Ui_Dialogs_RestoreTarget
source: Specify empty folder to unpack files
ru_ru: Выберите пустую папку для восстановления файлов

# Ui_Dialogs_SwitchLanguageFormat
source: Change language to {0} and restart application?
ru_ru: Сменить язык на {0} и перезапустить приложение?

# Ui_Folders_ExcludeFigLeafDir
source: Exclude FigLeaf folder
ru_ru: Не обрабатывать папку с этой программой

# Ui_Folders_Header
source: Folders
ru_ru: Папки

# Ui_Folders_Source
source: Source
ru_ru: Откуда

# Ui_Folders_Target
source: Target
ru_ru: Куда

# Ui_Security_Header
source: Archive
ru_ru: Безопасность

# Ui_Security_MasterPassword
source: Master password
ru_ru: Базовый пароль

# Ui_Security_PasswordRule
source: Password rule
ru_ru: Правило

# Ui_Security_ShowPassword
source: Show password
ru_ru: Показать пароль

# Ui_Thumbnails_Header
source: Thumbnails
ru_ru: Эскизы

# Ui_Thumbnails_Size
source: Size in pixels
ru_ru: Размер в пикселях
